modm-ext/data.modm.io/docs/svd/header_stm32f302xe.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP</name>
      <description>Analog Comparators</description>
      <baseAddress>0x4001001c</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COMPxEN</name>
              <description>COMPx enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPxSW1</name>
              <description>COMPx SW1 switch control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPxINSEL</name>
              <description>COMPx inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINUS_1_4VREFINT</name>
                  <description>Comparator input minus connected to 1/4 VrefInt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_1_2VREFINT</name>
                  <description>Comparator input minus connected to 1/2 VrefInt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_3_4VREFINT</name>
                  <description>Comparator input minus connected to 3/4 VrefInt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFINT</name>
                  <description>Comparator input minus connected to VrefInt</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH1</name>
                  <description>Comparator input minus connected to DAC1 channel 1 (DAC_OUT1)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input minus connected to IO1 (pin PA2 for COMP2)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input minus connected to IO2 (PB12 for COMP3, PB2 for COMP4, PB10 for COMP5, PB15 for COMP6 (COMP instance availability depends on the selected device))</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO3</name>
                  <description>Comparator input minus connected to IO3 (pin PA5 for COMP1/2/3/4/5/6/7 (COMP instance availability depends on the selected device))</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPxOUTSEL</name>
              <description>COMPx output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>COMP output is not connected to other peripherals (except GPIO and EXTI that are always connected to COMP output) (specific to COMP instance: COMP2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_BKIN</name>
                  <description>COMP output connected to TIM1 break input (BKIN)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_BKIN2</name>
                  <description>COMP output connected to TIM1 break input 2 (BKIN2)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OCCLR_COMP1_2_3</name>
                  <description>COMP output connected to TIM2 OCREF clear. Caution: Parameter specific to COMP instances, defined with generic naming, not taking into account COMP instance constraints. Refer to literal definitions above for COMP instance constraints.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_IC1_COMP1_2</name>
                  <description>COMP output connected to TIM1 input capture 1 (specific to COMP instance: COMP2)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_IC4_COMP1_2</name>
                  <description>COMP output connected to TIM2 input capture 4 (specific to COMP instance: COMP2)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_IC1_COMP1_2</name>
                  <description>COMP output connected to TIM3 input capture 1 (specific to COMP instance: COMP2)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_IC3_COMP4</name>
                  <description>COMP output connected to TIM3 input capture 3 (specific to COMP instance: COMP4)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM4_IC4_COMP6</name>
                  <description>COMP output connected to TIM4 input capture 4 (specific to COMP instance: COMP6)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPxPOL</name>
              <description>COMPx output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <description>COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPxBLANKING</name>
              <description>COMPx blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5_COMP1_2</name>
                  <description>Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP1, COMP2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3_COMP1_2</name>
                  <description>Comparator output blanking source TIM2 OC3 (specific to COMP instance: COMP1, COMP2)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC3_COMP1_2</name>
                  <description>Comparator output blanking source TIM3 OC3 (specific to COMP instance: COMP1, COMP2)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPxOUT</name>
              <description>COMPx output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPxLOCK</name>
              <description>COMPx lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
